In [1]:
import pandas as pd
import random as rd

In [2]:
rd.seed(42)
df1 = pd.DataFrame({
    'ruby':[rd.randint (1,20) for _ in range(4)],
    'amethyst':[rd.randint (1,20) for _ in range(4)],
    'cyan':[rd.randint (1,20) for _ in range(4)],
    'jade':[rd.randint (1,20) for _ in range(4)]
})

df2 = pd.DataFrame({
    'ruby':[rd.randint (1,20) for _ in range(4)],
    'amethyst':[rd.randint (1,20) for _ in range(4)],
    'cyan':[rd.randint (1,20) for _ in range(4)],
    'jade':[rd.randint (1,20) for _ in range(4)]
})

print(df1)
print(df2)

   ruby  amethyst  cyan  jade
0     4         8     3     1
1     1         5    19     3
2     9         4    14     7
3     8        18     2     8
   ruby  amethyst  cyan  jade
0    17         7    15     6
1    20        18    19    14
2     1        14     9    11
3    18         8     1     9

In [3]:
print(pd.concat([df1,df2]))

   ruby  amethyst  cyan  jade
0     4         8     3     1
1     1         5    19     3
2     9         4    14     7
3     8        18     2     8
0    17         7    15     6
1    20        18    19    14
2     1        14     9    11
3    18         8     1     9

In [4]:
df3=pd.concat([df1,df2])
print(df3.index)
print(df3.columns)
print(df3.shape)
print(df3.loc[3])

Index([0, 1, 2, 3, 0, 1, 2, 3], dtype='int64')
Index(['ruby', 'amethyst', 'cyan', 'jade'], dtype='object')
(8, 4)
   ruby  amethyst  cyan  jade
3     8        18     2     8
3    18         8     1     9

In [5]:
df3=pd.concat([df1,df2],ignore_index=True)
print(df3)
df3["cyan"]

   ruby  amethyst  cyan  jade
0     4         8     3     1
1     1         5    19     3
2     9         4    14     7
3     8        18     2     8
4    17         7    15     6
5    20        18    19    14
6     1        14     9    11
7    18         8     1     9

0     3
1    19
2    14
3     2
4    15
5    19
6     9
7     1
Name: cyan, dtype: int64

In [6]:
rd.seed(1)
df1 = pd.DataFrame({
    'ruby':[rd.randint (1,20) for _ in range(4)],
    'amethyst':[rd.randint (1,20) for _ in range(4)]
})
rd.seed(42)
df2 = pd.DataFrame({
   'cyan':[rd.randint (1,20) for _ in range(4)],
    'jade':[rd.randint (1,20) for _ in range(4)],
    'gold':[rd.randint (1,20) for _ in range(4)]
})
print(df1)
print(df2)

   ruby  amethyst
0     5         4
1    19        16
2     3        15
3     9        16
   cyan  jade  gold
0     4     8     3
1     1     5    19
2     9     4    14
3     8    18     2

In [7]:
df3 = pd.concat([df1,df2])
df3

   ruby  amethyst  cyan  jade  gold
0   5.0       4.0   NaN   NaN   NaN
1  19.0      16.0   NaN   NaN   NaN
2   3.0      15.0   NaN   NaN   NaN
3   9.0      16.0   NaN   NaN   NaN
0   NaN       NaN   4.0   8.0   3.0
1   NaN       NaN   1.0   5.0  19.0
2   NaN       NaN   9.0   4.0  14.0
3   NaN       NaN   8.0  18.0   2.0

In [8]:
df3 = pd.concat([df1,df2],axis=1)
df3

   ruby  amethyst  cyan  jade  gold
0     5         4     4     8     3
1    19        16     1     5    19
2     3        15     9     4    14
3     9        16     8    18     2

In [9]:
df3 = pd.concat([df1,df2],axis=1, join="inner")
df3

   ruby  amethyst  cyan  jade  gold
0     5         4     4     8     3
1    19        16     1     5    19
2     3        15     9     4    14
3     9        16     8    18     2

In [10]:
sucursal_A=pd.DataFrame({
    "Producto":["Laptop","Tablet","Smartphone"],
    "Ventas":[15,30,25]
})

sucursal_B=pd.DataFrame({
    "Producto":["Laptop","Tablet","Smartwatch"],
    "Ventas":[22,18,27]
})

print(sucursal_A)
print(sucursal_B)

     Producto  Ventas
0      Laptop      15
1      Tablet      30
2  Smartphone      25
     Producto  Ventas
0      Laptop      22
1      Tablet      18
2  Smartwatch      27

In [11]:
ventas_totales=pd.concat([sucursal_A.set_index("Producto"),
                          sucursal_B.set_index("Producto")],
                          axis=1, join="outer")
ventas_totales

            Ventas  Ventas
Producto
Laptop        15.0    22.0
Tablet        30.0    18.0
Smartphone    25.0     NaN
Smartwatch     NaN    27.0

In [12]:
ventas_totales=ventas_totales.fillna(0)
ventas_totales=ventas_totales.astype(int)
ventas_totales

            Ventas  Ventas
Producto
Laptop          15      22
Tablet          30      18
Smartphone      25       0
Smartwatch       0      27

In [13]:
rainbows = [] #Crear list vacía
for x in range(1):
    df=pd.DataFrame({
        'ruby':[rd.randint (1,20) for _ in range(1)],
        'amethyst':[rd.randint (1,20) for _ in range(1)],
        'cyan':[rd.randint (1,20) for _ in range(1)],
        'jade':[rd.randint (1,20) for _ in range(1)],
        'gold':[rd.randint (1,20) for _ in range(1)],
        'silver':[rd.randint (1,20) for _ in range(1)],
        'pearl':[rd.randint (1,20) for _ in range(1)],
    })
    rainbows.append(df)
rainbows

[   ruby  amethyst  cyan  jade  gold  silver  pearl
 0     1         3     7     8    17      20      1]

In [14]:
pd.concat(rainbows,axis=0,ignore_index=True)
rainbows

[   ruby  amethyst  cyan  jade  gold  silver  pearl
 0     1         3     7     8    17      20      1]

In [15]:
dfs=[]
for x in ["R","O","G","T","M"]:
    df = pd.DataFrame({x: [rd.randint(1,20) for _ in range(2)]})
    dfs.append(df)
dfs

[    R
 0  18
 1   7,
     O
 0  18
 1  14,
     G
 0   8
 1  15,
     T
 0  19
 1   9,
    M
 0  1
 1  6]

In [16]:
pd_1=pd.concat(dfs,axis=1)
pd_1

    R   O   G   T  M
0  18  18   8  19  1
1   7  14  15   9  6

In [17]:
h_df=pd.concat([df1,df2,df3], keys=["A","B","C"])
h_df

     ruby  amethyst  cyan  jade  gold
A 0   5.0       4.0   NaN   NaN   NaN
  1  19.0      16.0   NaN   NaN   NaN
  2   3.0      15.0   NaN   NaN   NaN
  3   9.0      16.0   NaN   NaN   NaN
B 0   NaN       NaN   4.0   8.0   3.0
  1   NaN       NaN   1.0   5.0  19.0
  2   NaN       NaN   9.0   4.0  14.0
  3   NaN       NaN   8.0  18.0   2.0
C 0   5.0       4.0   4.0   8.0   3.0
  1  19.0      16.0   1.0   5.0  19.0
  2   3.0      15.0   9.0   4.0  14.0
  3   9.0      16.0   8.0  18.0   2.0

In [ ]:
h_df.loc["A"]

   ruby  amethyst  cyan  jade  gold
0   5.0       4.0   NaN   NaN   NaN
1  19.0      16.0   NaN   NaN   NaN
2   3.0      15.0   NaN   NaN   NaN
3   9.0      16.0   NaN   NaN   NaN

In [21]:
h_df.loc[[("A",1),("B",3)]]

     ruby  amethyst  cyan  jade  gold
A 1  19.0      16.0   NaN   NaN   NaN
B 3   NaN       NaN   8.0  18.0   2.0